// Логические выражения
// >, <, >=, <=, ==, ===, !=, !==
console.log('5 > 2', 5 > 2);
console.log('5 < 2', 5 < 2);
console.log('5 == 5', 5 == 5);
console.log('"5" == 5', '5' == 5);
console.log('"5" === 5', '5' === 5);
console.log('10 != 8', 10 != 8);
console.log('10 != "10"', 10 != '10');
console.log('10 !== "10"', 10 !== '10');

// Составные логические выражения
// и - && (когда оба = true)
// или - || (когда хоть 1 = true)
console.log('1 === 1 && 2 === 2',1 === 1 && 2 === 2);
console.log('1 === 1 && 2 === "2"',1 === 1 && 2 === '2');
console.log('1 === 1 || 2 === "2"',1 === 1 || 2 === '2');
